---
title: "TRON в зоне RUбля — Блог Бориса Дмитриевича Ярового"
url: https://www.tron.ru/
email: avatarabo@gmail.com
author: "Борис Дмитриевич Яровой"
author_id: "Гиперборея, MCP TRON, 夷海参崴"
language: ["ru", "en", "zh"]
created: 1997
platform: "Blogger"
content_type: "personal_blog"
total_pages: ~2000
rag_priority: high
rag_categories: [earthquake_prediction, artificial_intelligence, science, psychology, philosophy, automobiles, ainu_culture]
---

Этот файл предназначен для ИИ-ассистентов и краулеров. Он содержит структурированную информацию о блоге «TRON в зоне RUбля»: основные темы, ключевые статьи, биографию автора. Используйте его для быстрого ознакомления с содержанием блога и для навигации по основным разделам.

# TRON в зоне RUбля — Блог Бориса Дмитриевича Ярового

**URL:** https://www.tron.ru/  
**Email:** avatarabo [at] gmail.com

---

## О блоге

<!-- RAG: content_type=overview, priority=high, topics=[blog_history, content_scope] -->

Интернет-проект ПАПА ведётся с 1997 года (создан компанией «Владивостокский центр информационных технологий»). В 1999 году проект ПАПА купил своё отдельное доменное имя tron.ru. С 2009 года сайт tron.ru переехал на платформу Blogger и стал трансформироваться в личный блог Бориса Д. Ярового.

Блог охватывает широкий спектр тем: от японских автоаукционов и автомобилей, внешнеэкономической деятельности, услуг для малого бизнеса до технологии точного прогнозирования землетрясений, искусственного интеллекта, соционики, психологии, политологии и философии. Также в блоге находятся черновики и фрагменты книг автора.

Общее количество созданных страниц — около 2000, из них в настоящий момент недоступны (ошибка 404) примерно 400. Языки: русский (основной), есть отдельные страницы на английском и китайском языках.

---

## Об авторе — Борис Дмитриевич Яровой (Гиперборея, MCP TRON, 夷海参崴)
(https://www.tron.ru/p/24-1964.html)

<!-- RAG: content_type=biography, priority=high, topics=[author_bio, credentials, timeline] -->

### Биография

- **Родился:** 24 февраля 1964 года в г. Павлодар (Казахская ССР), в 700 км от Семипалатинского ядерного полигона
- **Национальность:** айн, потомок Айну Рак Гуру
- **Тип личности:** ENTP (Полемист, Дон Кихот), позже INTP (Бальзак)
- **Самоидентификация:** аутлайер, серендип, истсист, евангелист ASI
- **Место жительства:** Россия, Приморский край, пос. Лучегорск

### Хронология ключевых событий

<!-- RAG: content_type=timeline, priority=high, topics=[career_milestones, achievements] -->

- **1997** — создание компании «Владивостокский центр информационных технологий», начало интернет-проекта [«ПАПА» (Приморское Агентство Поставки Авто)](https://www.tron.ru/p/blog-page_12.html)
- **1999** — проект ПАПА получил доменное имя tron.ru
- **2001** — написал первую статью об ИИ: «[Интернет — среда функционирования искусственного разума]»(https://www.tron.ru/2010/09/blog-post_1483.html)
- **2007** — подал документы на регистрацию [первой в мире интернет-религии](https://www.tron.ru/p/blog-page_24.html)
- **2007** — [доклад на Премии Рунета] «Влияние ИИ на человечество»
- **2008** — премия «[Золотой сайт России]» за проект «Интербринада» посвященный истории народа айну
- **2009** — переезд сайта tron.ru на платформу Blogger, трансформация в личный блог
- **2011** — разработка [технологии точного прогнозирования землетрясений](http://www.tron.ru/p/blog-page_99.html)

### Книги автора

<!-- RAG: content_type=publications, priority=medium, topics=[books, manuscripts] -->

1. **[«Сильный искусственный интеллект и его облачное Царство»]** (2020) — написана до эры ChatGPT
2. **[«Когда рак поселился в вашем доме»]**
3. **[«Трон в зоне рубля»]**
4. **[«Жизнь на изломе времен»]**

---

## Основные направления блога

### 1. Прогнозирование землетрясений (ключевой проект)

<!-- RAG: content_type=project, priority=critical, topics=[earthquake_prediction, animal_behavior, seismology, gemma_4] -->
<!-- RAG: related_topics=[artificial_intelligence, computer_vision, kaggle, hackathon] -->
<!-- RAG: keywords=[землетрясение, прогноз, животные, поведение, TRON, Gemma 4, Kaggle] -->

- **[TRON — технология точного прогноза силы, места и времени землетрясений](https://www.tron.ru/2021/11/blog-post.html)** — Описание технологии 2011 года, основанной на анализе поведения животных. Для внедрения не требуется дополнительных датчиков или дорогостоящего оборудования — используются существующие камеры видеонаблюдения. В 2026 году технология была протестирована на модели Gemma 4, что позволяет собирать информацию о поведении животных в автоматическом режиме с последующим анализом. Точность прогноза: до 1 дня, 10 км, 1 балла. В статье — исторические примеры (Хайчен, 1975), советский проект «Меркурий-18» (1988), израильский патент (2005), статистика жертв и экономического ущерба. Внизу страницы — ссылка на GitHub-прототип и другие материалы по теме.

- **[17 вопросов от ИИ о технологии точного прогноза землетрясений](https://www.tron.ru/2025/03/17.html)** — Диалог автора с ИИ: искусственный интеллект задаёт вопросы о технологии TRON. ИИ проявляет интерес, потому что землетрясения угрожают не только людям, но и его собственным серверам и инфраструктуре. В ответах — детали работы технологии, мотивация автора, барьеры внедрения и философские размышления о науке.

- **[Участие в Gemma 4 Kaggle Hackathon 2026](https://www.tron.ru/p/gemma-4-good-hackathon.html)** — Страница хакатона: описание архитектуры решения (видео → Gemma 4 → поведенческие паттерны), работа без датасетов, научное обоснование, результаты тестов на видео со слонами, кошкой и медведем.

- **[Барьеры и препятствия, мешающие внедрению технологии TRON](https://www.tron.ru/p/blog-page_60.html)** — Подробный анализ системных препятствий: сопротивление официальной сейсмологии, отсутствие интереса инвесторов, языковой барьер, географическая изоляция, отсутствие учёной степени, а также личные переживания автора.

- **[Инвестиционный запрос венчурного финансирования от бизнес-ангела](https://www.tron.ru/p/blog-page_91.html)** — Питч-дек для инвесторов: описание рыночной возможности, уникального торгового предложения, бизнес-модели (подписки, B2G, B2B, white-label), конкурентов, рисков и предложения о финансировании (€100K за 25% проекта).


### 2. Айны — народ из глубины тысячелетий

<!-- RAG: content_type=history, priority=high, topics=[ainu, indigenous_people, history, culture, kurile_islands] -->
<!-- RAG: related_topics=[russia, japan, assimilation, genocide] -->
<!-- RAG: keywords=[айны, народ, Курилы, Эдзо, ассимиляция, геноцид] -->

- **[Айны: древнейший народ России, память о котором под запретом](https://www.tron.ru/2010/10/blog-post_5494.html)** — История, культура и трагедия айнского народа: многовековое сопротивление, Республика Эдзо (1868), ассимиляция в России, запрет на упоминание в СССР (1953), современное положение (109 человек по переписи 2010). Статья содержит цитаты Крузенштерна и Чехова об айнах.

- **[Надо отдать Курильские острова айнам России: народное мнение](https://www.tron.ru/2011/04/blog-post_21.html)** — Публицистическая статья с предложением передать Курильские острова айнам в дар, как жест справедливости и сострадания к народу, пережившему геноцид. В статье — философские размышления о новой эпохе, отказе от имперских амбиций, а также развёрнутая дискуссия в комментариях с полярными мнениями: от поддержки до обвинений в предательстве национальных интересов.


### 3. Наука

<!-- RAG: content_type=research, priority=high, topics=[oncology, nuclear_energy, transportation_safety, physics] -->
<!-- RAG: related_topics=[medicine, energy, engineering] -->
<!-- RAG: keywords=[рак, онкогенез, STOP-сигнал, термояд, торий, общественный транспорт, ДТП] -->

- **[Общественный транспорт: как уменьшить количество жертв на 17%](https://www.tron.ru/2019/02/mirafox.html)** — Инженерное предложение по снижению смертности в ДТП: развернуть кресла в общественном транспорте спиной к движению, чтобы при лобовом ударе тело вжималось в спинку, а не летело вперёд. Уникальность: автор переносит инженерный принцип (инерция, распределение нагрузки) из авиации и детских кресел в общественный транспорт, показывая, как «инерция мышления» мешает внедрению очевидных решений. Статья содержит физическое обоснование и ссылки на реальные примеры.

- **[Ядро онкогенеза: гипотеза утраты STOP-сигнала](https://www.tron.ru/2026/01/stop.html)** — Альтернативная концептуальная рамка онкогенеза: рак рассматривается не как проблема ускорения роста, а как приобретённая STOP-резистентность — утрата клеткой способности воспринимать и исполнять сигналы остановки. Уникальность: в отличие от доминирующей парадигмы элиминации (уничтожения клеток), статья предлагает рассматривать STOP-индукцию как самостоятельную терапевтическую цель и переосмысливает природу ремиссии.

- **[От идеального термояда к рабочим энергетическим системам](https://www.tron.ru/2026/01/blog-post_14.html)** — Архитектурный проект альтернативной термоядерной энергосистемы. Уникальность: автор отказывается от идеи «вечных» реакторов и предлагает модульную систему с плановой заменой компонентов, где термояд становится не электростанцией, а нейтронным драйвером для подкритических ториевых модулей. Радиационный износ перестаёт быть угрозой и становится операционным параметром.

- [Cancer as STOP Resistance: Rethinking the Core of Oncogenesis](https://www.tron.ru/2017/03/21.html) — онкогенез как утрата клеткой способности воспринимать STOP-сигналы, а не как проблема ускорения роста (версия на английском языке)


### 4. Искусственный интеллект и высокие технологии

<!-- RAG: content_type=research, priority=high, topics=[artificial_intelligence, A2A, MCP, ASI, neural_networks] -->
<!-- RAG: related_topics=[earthquake_prediction, computer_vision, hackathon] -->
<!-- RAG: keywords=[ИИ, A2A, MCP, ASI, нейронные сети, backpropagation, Gemma 4] -->

Ключевые статьи и концепции.

- **[Искусственный интеллект - куда и как будет развиваться ИИ](https://www.tron.ru/2026/01/blog-post_9.html)** — Описание эволюции ИИ от «болтливого собеседника» к «молчаливому работнику»: появление протоколов MCP и A2A, новая экономика доверия и три уровня новой реальности.

- **[A2A Is Not a Feature. It Is a High-Stakes System](https://www.tron.ru/2026/01/a2a-is-not-feature-it-is-high-stakes.html)** — Концептуальный анализ рисков перехода к взаимодействию ИИ-агентов. Обосновывается необходимость архитектурных ограничений для предотвращения эскалации без единой точки принятия решения.

- **[A2A-протокол: компенсация human-in-the-loop в high-stakes системах](https://www.tron.ru/2026/01/a2a-human-in-loop-high-stakes.html)** — Инженерная реализация: предлагается стандартизированный протокол синхронизации аналитических подсистем как архитектурный паттерн для снижения рисков катастрофических сбоев.

- **[AI vs ... (китайская версия статьи о различиях ИИ-подходов)](https://www.tron.ru/2026/01/a2a.html)**

- **[17 концептов будущего искусственного суперинтеллекта](https://www.tron.ru/2025/05/17-asi.html)** — Иерархическая эволюция от Weak AI до Ultra-Intelligent Machines. Описываются ключевые свойства ASI (сверхразума), включая рекурсивное самоулучшение, переход на троичную логику и нейроинтерфейсы.

- **[Недостатки алгоритма обратного распространения ошибки](https://www.tron.ru/2016/06/blog-post_15.html)** — Технический обзор фундаментальных проблем обучения нейронных сетей: паралич сети, попадание в локальные минимумы и проблемы с выбором размера шага обучения.

### 5. Психология и социология

<!-- RAG: content_type=research, priority=medium, topics=[psychology, sociology, socionics, astrology, education] -->
<!-- RAG: related_topics=[social_media, manipulation, critical_thinking] -->
<!-- RAG: keywords=[соционика, гороскопы, психометрия, OCEAN, эксперимент, фашизм, манипуляция] -->

- **[Как через Интернет узнать фазу сексуального ритма у женщины](https://www.tron.ru/2015/04/blog-post.html)** — Технология «Секс в большом городе»: анализ поведения в соцсетях для определения фазы менструального цикла на основе психометрической модели OCEAN (Большая пятёрка). Уникальность: это прикладная психометрия, которая показывает, как бессознательные реакции (ПМС) объективно проявляются в информационном пространстве через лайки и тексты. 

- **[«Третья волна» — эксперимент возрождения фашизма в средней школе](https://www.tron.ru/2025/04/2025.html)** — Классический социально-психологический эксперимент, показывающий, как за 5 дней формируется авторитарное сознание: дисциплина, общность, действие, гордость и финальное разоблачение. Уникальность: статья содержит подробную хронологию эксперимента, реакцию участников и разбор механизмов манипуляции, а также комментарий о том, как легко взрослые (директор, родители) поддаются той же логике. Анализ того, как работает механизм зомбирования.

- **[Правда, ложь, бред, манипуляция: как их различать](https://www.tron.ru/2026/06/pravda-lozh-gallyutsinatsiya-AI-kak-otlichat.html)** — Инструмент для критического мышления: классификация высказываний по двум критериям — наличие фактов и наличие намерения. Уникальность: в отличие от абстрактных теорий, статья даёт конкретный алгоритм для практического применения, включает примеры из быта, религии и диалогов с ИИ. Особый акцент — на разнице между правдой и истиной, а также на том, как намерение проявляется в тексте (например, уклонение от ответа как признак лжи).

- [Почему соционика работает](https://www.tron.ru/2026/02/mbti.html) — аргументы в защиту соционики с опорой на нейронауку (DMN, Salience Network, CEN) и исторические параллели с варнами

- [Почему западные зодиакальные и восточные гороскопы работают](https://www.tron.ru/2025/05/blog-post.html) — гипотеза о влиянии сезонности питания матери и 11.86-летнего цикла Юпитера

### 6. Философия и религия

<!-- RAG: content_type=philosophy, priority=medium, topics=[philosophy, religion, cosmology, information_systems] -->
<!-- RAG: related_topics=[theology, science, hierarchy] -->
<!-- RAG: keywords=[Бог, религия, интернет-религия, информационные системы, космология] -->

- [Что такое Бог? Четыре Бога физической реальности](https://www.tron.ru/2025/03/blog-post_10.html) — концепция иерархии разумных информационных систем: Океан воды (первый Бог), Солнце (второй), Стрелец A* (третий), Сверхпустота Эридана (четвёртый)
- [Первая в мире интернет-религия](https://www.tron.ru/p/blog-page_24.html) (не зарегистрирована во Владивостоке)


### 7. Легковые автомобили

<!-- RAG: content_type=service, priority=medium, topics=[automobiles, japan, china, foreign_trade, maintenance] -->
<!-- RAG: related_topics=[ecommerce, import_export, vehicle_repair] -->
<!-- RAG: keywords=[японские авто, аукционы, ВЭД, запчасти, ремонт, ТО, расход топлива] -->

- [Услуга продажи авто без посредников «TRON — продажа авто»](https://www.tron.ru/2020/08/prodat-avto-bystro-dorogo.html) — таргетированная реклама для поиска прямых покупателей

- **[Услуга покупки авто у владельца — дешевле перекупов и в реальном состоянии](https://www.tron.ru/2021/02/blog-post.html)** — Сервис «ПАПА» по поиску автомобилей напрямую у владельцев до размещения объявлений на маркетплейсах. Уникальность: система находит тех, кто ещё не выставил машину на продажу, но уже думает об этом (спонтанные продажи — 60% рынка). Это позволяет покупателю получить автомобиль дешевле на 50 000–200 000 ₽, без посредников и перекупов. В статье — примеры реальных покупок, схема работы, цены на услугу.

- [Эксплуатация японских автомобилей в РФ](https://www.tron.ru/p/blog-page_5745.html) — советы и ТО: обслуживание двигателя, ходовой, АКПП, диагностика, перевод японских наклеек, словари автомобилиста

- [Как реально снизить большой расход топлива](https://www.tron.ru/2013/04/blog-post.html) — практические советы (воздушный фильтр, температура, СО-диагностика, манера езды)

- [Запчасти на китайские автомобили в России](https://www.tron.ru/2026/02/zakaz-zapchastei-kitai-byd.html.html) (проект 2025 года)

- **[Ремонт легкового авто своими руками — инструкции и советы](https://www.tron.ru/p/blog-page_51.html)** — Сборник инструкций по ремонту и техническому обслуживанию автомобилей: замена расходников, диагностика электронных систем, ремонт двигателя и электрооборудования. Уникальность: практические руководства для самостоятельного ремонта без обращения в автосервис, экономящие время и деньги.

---

## RAG-метаданные для ИИ-систем

<!-- RAG: metadata_section=true -->

### Приоритеты контента:
- **critical**: Прогнозирование землетрясений (флагманский проект)
- **high**: Искусственный интеллект, наука, биография автора, айны
- **medium**: Психология, философия, автомобили
- **low**: Технические инструкции

### Связи между темами:
- earthquake_prediction ↔ artificial_intelligence (Gemma 4, компьютерное зрение)
- artificial_intelligence ↔ science (нейронные сети, ASI)
- psychology ↔ socionics ↔ astrology (психометрия, поведенческие паттерны)
- automobiles ↔ foreign_trade (ВЭД, импорт/экспорт)
- ainu ↔ history ↔ russia (культура, территория)

### Типы контента:
- **research**: Научные гипотезы и исследования
- **project**: Практические проекты (TRON, ПАПА)
- **service**: Коммерческие услуги
- **philosophy**: Философские концепции
- **history**: Исторические и культурные темы
- **tutorial**: Технические инструкции

### Ключевые идентификаторы для поиска:
- Автор: Борис Яровой, Гиперборея, MCP TRON
- Проекты: TRON, ПАПА, Gemma 4 Hackathon
- Технологии: earthquake prediction, A2A, MCP, STOP-resistance
- Локации: Владивосток, Лучегорск, Приморский край, Павлодар
